[
  {
    "id": 1,
    "name": "Борщівська вишивка",
    "description": "Унікальний стиль вишитої сорочки з Тернопільського Поділля (Борщівський район), що вирізняється домінуючим чорним кольором (\"шиття чорним\"), який, за легендою, символізує траур жінок за загиблими чоловіками. Орнаменти переважно геометричні, виконані густими вовняними нитками.",
    "key_elements": [
      "Ромб з крапками",
      "S-подібні мотиви (\"вужі\")",
      "Ламані лінії",
      "Трикутники"
    ],
    "technique": "занизування (верхоплут), пряма гладь, кручений шов",
    "key_colors": [
      "#000000",
      "#8B0000",
      "#551A8B",
      "#006400"
    ]
  },
  {
    "id": 2,
    "name": "Гуцульська вишивка",
    "description": "Яскрава та багатобарвна вишивка з карпатського високогір'я (Гуцульщина), що вирізняється багатством колориту та динамічними геометричними композиціями. Щільні візерунки, що вкривають рукави, створюють враження калейдоскопу завдяки контрастному поєднанню теплих і холодних кольорів. Цей стиль відображає енергійний характер та багату міфологію гуцулів.",
    "key_elements": [
      "Ромб",
      "Хрест",
      "Розета",
      "Трикутник",
      "Клинці"
    ],
    "technique": "низинка, хрестик, кручений шов, заволікання, гладь",
    "key_colors": [
      "#FFA500", 
      "#008000", 
      "#FFFF00", 
      "#FF0000", 
      "#000000" 
    ]
  },
  {
    "id": 3,
    "name": "Буковинська вишивка",
    "description": "Розкішний та святковий стиль з Буковини, відомий своїми пишно вишитими рукавами, часто з характерними косими смугами. Поряд із геометричними візерунками поширені великі рослинні мотиви, особливо троянди. Особливої урочистості надає щедре використання бісеру, срібних і золотих ниток.",
    "key_elements": [
      "Троянда",
      "Птахи",
      "Ромб",
      "Листя",
      "Виноград"
    ],
    "technique": "гладь, хрестик, низинка, кручений шов, бісер, штаповка, цирка (мережка)",
    "key_colors": [
      "#FF0000", 
      "#000000", 
      "#008000", 
      "#FFFF00"
    ]
  },
  {
    "id": 4,
    "name": "Покутська вишивка",
    "description": "Насичений та густий стиль з Покуття, що межує з Гуцульщиною та Буковиною. Характеризується домінуванням яскравого червоного кольору, часто виконаного товстими вовняними нитками, що створює рельєфну фактуру. Орнаменти поєднують складну геометрію з сильно стилізованими рослинними мотивами.",
    "key_elements": [
      "Ромб",
      "Кривульки",
      "Пшеничка",
      "Зірка"
    ],
    "technique": "низинка, хрестик, штапівка, брижування, кафасор",
    "key_colors": [
      "#FF0000", 
      "#000000", 
      "#FFFF00"
    ]
  },
  {
    "id": 5,
    "name": "Бойківська вишивка",
    "description": "Стримана та лаконічна вишивка бойків, що відзначається вишуканою простотою та чіткістю геометричних композицій. Унікальною рисою є техніка «брижування» — вишивка по збираній тканині на манжетах та плечах, яка одночасно прикрашає та конструктивно формує одяг. Палітра переважно обмежується червоним і чорним або синім кольорами.",
    "key_elements": [
      "Ромб",
      "Ламаний хрест",
      "Драбинки",
      "Сосонки",
      "Квадрат"
    ],
    "technique": "брижування, низинка (набирування), лічильна гладь (настилування), хрестик, вирізування",
    "key_colors": [
      "#FF0000", 
      "#000000", 
      "#0000FF"
    ]
  },
  {
    "id": 6,
    "name": "Лемківська вишивка",
    "description": "Самобутня вишивка найзахіднішої етнографічної групи українців — лемків. Для неї характерні архаїчні лінійні мотиви та особлива колористика, де суцільне червоне тло заповнюється різнокольоровими візерунками. Густа вишивка традиційно розташовується на комірі, манжетах та вздовж пазухи сорочки.",
    "key_elements": [
      "Ромб",
      "Зигзаг",
      "Хрест",
      "Стилізовані квіти",
      "Зірка"
    ],
    "technique": "хрестик, гладь, заволікання, брижування",
    "key_colors": [
      "#C70039",
      "#000000",
      "#191970"
    ]
  },
  {
    "id": 7,
    "name": "Яворівська вишивка",
    "description": "Барвистий стиль з Яворівщини (Галичина), що прославився завдяки своїм життєрадісним квітковим та рослинним композиціям. Особливістю є техніка двосторонньої гладі, відома як «гапт» або «славна Яворівка». Візерунки часто зображують вазони з квітами, гілки та вінки, вишиті яскравими, контрастними кольорами.",
    "key_elements": [
      "Ружа",
      "Барвінок",
      "Сосонки",
      "Кривульки",
      "Дубове листя"
    ],
    "technique": "гапт (двобічна гладь), хрестик, стебнівка",
    "key_colors": [
      "#008000",
      "#FF0000",
      "#FFFF00",
      "#FFA500"
    ]
  },
  {
    "id": 8,
    "name": "Волинська вишивка",
    "description": "Строга та графічна вишивка Волині, для якої характерні чіткі геометричні візерунки, що рівномірно вкривають усю поверхню рукава. Домінуючий насичений червоний колір, іноді з додаванням чорного або синього, створює виразний орнамент, що нагадує ткацтво. Простота мотивів — зірок, ромбів, ламаних ліній — поєднується з ритмічною довершеністю композиції.",
    "key_elements": [
      "Зірка",
      "Ромб",
      "Ламані лінії",
      "Хмелик",
      "Баранячі роги"
    ],
    "technique": "занизування, хрестик, штапівка (стебнівка)",
    "key_colors": [
      "#FF0000", 
      "#000000", 
      "#0000FF"
    ]
  },
  {
    "id": 9,
    "name": "Поліська вишивка",
    "description": "Архаїчна та монументальна вишивка з лісистого Полісся, що зберегла одні з найдавніших орнаментів. Характеризується лаконічними геометричними мотивами, виконаними майже виключно червоною ниткою на білому або сірому домотканому полотні. Візерунки, що нагадують ткацтво, розташовуються чіткими горизонтальними смугами, створюючи враження сили та гармонії.",
    "key_elements": [
      "Ромб",
      "Розетка",
      "Восьмикутна зірка",
      "Квітка-зоря"
    ],
    "technique": "занизування, заволікання, вирізування, мережка, хрестик",
    "key_colors": [
      "#FF0000", 
      "#FFFFFF"
    ]
  },
  {
    "id": 10,
    "name": "Київська вишивка",
    "description": "Вишивка серця України, що гармонійно поєднує рослинні та геометричні мотиви. Візитівкою стилю є стилізовані грона винограду, гілки хмелю та восьмикутні зірки, виконані в характерній палітрі коралово-червоного, білого та чорного кольорів. Часто орнаменти доповнюються ажурними мережками, що додає виробам легкості.",
    "key_elements": [
      "Грона винограду",
      "Хміль",
      "Ромб",
      "Восьмикутна зірка",
      "Калина"
    ],
    "technique": "лиштва (лічильна гладь), набирування, хрестик, вирізування, мережка",
    "key_colors": [
      "#E34234",
      "#FFFFFF",
      "#000000"
    ]
  },
  {
    "id": 11,
    "name": "Полтавська вишивка (білим по білому)",
    "description": "Вишуканий та аристократичний стиль з Полтавщини, що вважається вершиною українського вишивального мистецтва. Його унікальність полягає у виконанні складних візерунків білими нитками по білому полотну, де краса орнаменту розкривається через гру світла і тіні на рельєфній поверхні. Ця ювелірна техніка, що поєднує до десяти видів швів, нагадує морозні візерунки на склі.",
    "key_elements": [
      "Дерево Життя",
      "Ромб",
      "Зірка",
      "Сніжинка",
      "Яблучка"
    ],
    "technique": "лиштва, вирізування, мережка, зерновий вивід, солов'їні вічка",
    "key_colors": [
      "#FFFFFF"
    ]
  },
  {
    "id": 12,
    "name": "Черкаська вишивка",
    "description": "Класичний зразок вишивки Середньої Наддніпрянщини, що походить з козацького краю. Для стилю характерні складні, симетричні композиції з геометричних та рослинних мотивів, виконані переважно червоними нитками з додаванням чорного. Орнаменти відрізняються філігранною деталізацією та великою кількістю дрібних елементів.",
    "key_elements": [
      "Дерево Життя",
      "Ромб",
      "Восьмикутна зірка",
      "Калина",
      "Журавель"
    ],
    "technique": "лиштва, хрестик, низинка, зерновий вивід, мережка, солов'їні вічка",
    "key_colors": [
      "#FF0000",
      "#000000",
      "#FFFFFF"
    ]
  },
  {
    "id": 13,
    "name": "Слобожанська вишивка",
    "description": "Своєрідна вишивка східних земель України, що вирізняється поліхромними візерунками та рельєфною фактурою, створеною завдяки використанню товстих ниток. Поряд з рослинними та геометричними орнаментами, унікальною рисою є широке використання зооморфних (птахи, тварини) і навіть антропоморфних (людські фігури) мотивів. Характерним є сміливе поєднання червоного та синього кольорів.",
    "key_elements": [
      "Дерево Життя",
      "Птахи",
      "Трикутники",
      "Ромб",
      "Квіти"
    ],
    "technique": "хрестик, півхрестик, тамбурний шов, лиштва, вирізування",
    "key_colors": [
      "#FF0000",
      "#0000FF",
      "#000000"
    ]
  },
  {
    "id": 14,
    "name": "Таврійська вишивка",
    "description": "Відроджений стиль вишивки, що базується на традиційному таврійському розписі південних степів та узбережжя Чорного моря. Орнаменти мають графічний характер і відображають місцеву природу: морську флору і фауну, човни, маяки та стилізовані хвилі. Ця вишивка є яскравим прикладом адаптації народного малярства до мистецтва вишивання.",
    "key_elements": [
      "Риба",
      "Човен",
      "Маяк",
      "Хвиля",
      "Птах"
    ],
    "technique": "гладь, стебнівка, рушникові шви",
    "key_colors": [
      "#0000FF", 
      "#008000", 
      "#FFFF00"
    ]
  },
  {
    "id": 15,
    "name": "Кримськотатарська вишивка (Qasnaq)",
    "description": "Унікальне мистецтво корінного народу Криму, що відрізняється від слов'янських традицій своєю витонченою рослинною орнаментикою (Örnek) та складною мовою символів. Характерною є техніка тамбурного шва «Qasnaq», виконана шовковими та золотими нитками на оксамиті чи тонкому полотні. Кожен елемент — троянда (жінка), тюльпан (юнак), гранат (сім'я) — несе глибокий смисловий зміст.",
    "key_elements": [
      "Дерево Життя",
      "Троянда",
      "Тюльпан",
      "Гранат",
      "Гвоздика"
    ],
    "technique": "Qasnaq (тамбурний шов), Tatar ishleme (двостороння гладь), букме",
    "key_colors": [
      "#FF1493", 
      "#32CD32", 
      "#1E90FF", 
      "#FFD700"
    ]
  }
]